
public class Exam1 {
	public static void main(String[] args){
		
		/******************变量构建方式一********************/
		//创建变量  声明变量的数据类型，并起上变量名
		int money;
		//对变量进行赋值
		money = 100;
		//变量的值可以变更
		//money = 200;
		//变量名不能重复
		//int money = 300;
		//使用变量的时候变量一定要赋值
		System.out.print(money);
		
		/******************变量构建方式二********************/
		//创建变量可以在声明时同时赋值
		int number = 10;
		
		/******************变量构建方式三********************/
		//如果是创建多个相同类型变量的时候可以同时进行声明
		//int a = 1;
		//int b = 2;
		int a = 1,b;
		
	}
	
}
